In [5]:
# Series 연산
from pandas import Series

s1 = Series([10, 15, 20], index=['일','이','삼'])
s2 = Series([2,4,6,8], index=['일','이','삼','사'])
print(s1)
s2

일    10
이    15
삼    20
dtype: int64

일    2
이    4
삼    6
사    8
dtype: int64

In [2]:
s3 = Series([1,2,3],index=['1줄','2줄','3줄'])

In [6]:
# DataFrame 연산

from pandas import DataFrame
import numpy as np

df1 = DataFrame(np.zeros((3,3), dtype='int32'), index=['one','two','three'])
df2 = DataFrame(np.zeros((3,3), dtype='int32'), index=['one','two','three'])

In [7]:
df1 + df2

       0  1  2
one    0  0  0
two    0  0  0
three  0  0  0

In [9]:
df3 = DataFrame(np.ones((4,4), dtype='int32'), index=['one','two','three','four'])

In [15]:
df3.add(df1, fill_value=0)

         0    1    2    3
four   1.0  1.0  1.0  1.0
one    1.0  1.0  1.0  1.0
three  1.0  1.0  1.0  1.0
two    1.0  1.0  1.0  1.0

문자열이 있는 데이타프레임의 연산

In [16]:
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }

df = DataFrame(mydata)
df

  name  age dept
0  홍길동   22   컴공
1  박길동   33   국어
2  김길동   44   산업

In [18]:
df * 3

        name  age    dept
0  홍길동홍길동홍길동   66  컴공컴공컴공
1  박길동박길동박길동   99  국어국어국어
2  김길동김길동김길동  132  산업산업산업